OttoMeister/esp32-metar-weather/src/main.cpp
  // Focus styling
  lv_obj_set_style_border_color(ta, lv_color_hex(0x3366ff), LV_PART_MAIN | LV_STATE_FOCUSED);
  lv_obj_set_style_border_width(ta, 2, LV_PART_MAIN | LV_STATE_FOCUSED);
  
  // Cursor styling
  lv_obj_set_style_bg_color(ta, lv_color_white(), LV_PART_CURSOR);
  
  if (event_cb) lv_obj_add_event_cb(ta, event_cb, LV_EVENT_ALL, NULL);
  lv_textarea_set_text(ta, initial_text);
  
  return ta;
}

// Initialize main screen with improved layout and better spacing
void ui_scrMain_screen_init(void) {
  ui_scrMain = lv_obj_create(NULL);
  lv_obj_remove_flag(ui_scrMain, LV_OBJ_FLAG_SCROLLABLE);
  lv_obj_set_style_bg_color(ui_scrMain, lv_color_hex(0x0d1117), LV_PART_MAIN);
  lv_obj_set_style_bg_grad_color(ui_scrMain, lv_color_hex(0x161b22), LV_PART_MAIN);
  lv_obj_set_style_bg_grad_dir(ui_scrMain, LV_GRAD_DIR_VER, LV_PART_MAIN);
  // Header card 
  lv_obj_t *header_card = create_card(ui_scrMain, 5, 5, 790, 80);
  lblWifiStatus = create_styled_label(header_card, 0, -5, "Disconnected", LV_SYMBOL_CLOSE);
  lblTimeDate = create_styled_label(header_card, 0, 25, "Time: --", LV_SYMBOL_LIST);
  create_gradient_button(header_card,  650, 0, 110, 40, "Settings", LV_SYMBOL_SETTINGS, ui_event_btnSettings);
  // Airport info card
  lv_obj_t *airport_card = create_card(ui_scrMain, 5, 90, 790, 45);
  lblAirportName = create_styled_label(airport_card, 0, -5, "Airport: --", LV_SYMBOL_HOME, true);
  lblDataAge = create_styled_label(airport_card, 400, -5, "Data Age: -- min", LV_SYMBOL_REFRESH);  
  // Weather data card - left side
  lv_obj_t *weather_card = create_card(ui_scrMain, 5, 140, 390, 185);
  lv_obj_t *weather_title = create_styled_label(weather_card, 0, -5, "Weather Data", LV_SYMBOL_EYE_OPEN, true);
  lv_obj_set_style_text_color(weather_title, lv_color_hex(0x3366ff), LV_PART_MAIN);
  lblWeatherIcon = create_styled_label(weather_card, 320, -5, LV_SYMBOL_EYE_OPEN, nullptr, true);
  lblTemperature = create_styled_label(weather_card, 0, 25, "Temperature: -- °C", LV_SYMBOL_BATTERY_3);
  lblHumidity = create_styled_label(weather_card, 0, 55, "Humidity: -- %", LV_SYMBOL_TINT);
  lblWindSpeed = create_styled_label(weather_card, 0, 85, "Wind Speed: -- km/h", LV_SYMBOL_GPS);
  lblPressure = create_styled_label(weather_card, 0, 115, "Pressure: -- hPa", LV_SYMBOL_POWER);
  // Sun times card - right side
  lv_obj_t *sun_card = create_card(ui_scrMain, 405, 140, 390, 185);
  lv_obj_t *sun_title = create_styled_label(sun_card, 0, -5, "Sun Times", LV_SYMBOL_WIFI, true);
  lv_obj_set_style_text_color(sun_title, lv_color_hex(0xffa500), LV_PART_MAIN);
  lblSunrise = create_styled_label(sun_card, 0, 25, "Sunrise: --", LV_SYMBOL_UP);
  lblSunset = create_styled_label(sun_card, 0, 55, "Sunset: --", LV_SYMBOL_DOWN);
  lv_obj_t *info_label1 = create_styled_label(sun_card, 0, 85, "Daylight Info", nullptr);
  lv_obj_set_style_text_color(info_label1, lv_color_hex(0x888888), LV_PART_MAIN);
  // Status bar at bottom
  lv_obj_t *status_card = create_card(ui_scrMain, 5, 430, 790, 45);
  lv_obj_t *status_label = create_styled_label(status_card, 0, -5, "ESP32 METAR Weather Station", LV_SYMBOL_EYE_OPEN);
  lv_obj_set_style_text_color(status_label, lv_color_hex(0x3366ff), LV_PART_MAIN);
  lv_obj_t *version_label = create_styled_label(status_card, 600, -5, "v1.0", nullptr);
  lv_obj_set_style_text_color(version_label, lv_color_hex(0x888888), LV_PART_MAIN);
}

// Initialize settings screen with modern design and better spacing
void ui_scrSetting_screen_init(void) {
  ui_scrSetting = lv_obj_create(NULL);
  lv_obj_remove_flag(ui_scrSetting, LV_OBJ_FLAG_SCROLLABLE);
  lv_obj_set_style_bg_color(ui_scrSetting, lv_color_hex(0x0d1117), LV_PART_MAIN);
  lv_obj_set_style_bg_grad_color(ui_scrSetting, lv_color_hex(0x161b22), LV_PART_MAIN);
  lv_obj_set_style_bg_grad_dir(ui_scrSetting, LV_GRAD_DIR_VER, LV_PART_MAIN);
  // Setting Header card 
  lv_obj_t *header_card = create_card(ui_scrSetting, 5, 5, 790, 70);
  lv_obj_t *title = create_styled_label(header_card, 0, 5, "Weather Station Settings", LV_SYMBOL_SETTINGS, true);
  lv_obj_set_style_text_color(title, lv_color_hex(0x3366ff), LV_PART_MAIN);
  create_gradient_button(header_card, 650, -5, 110, 40, "Save", LV_SYMBOL_SAVE, ui_event_btnBack);
  // Settings card 
  lv_obj_t *form_card = create_card(ui_scrSetting, 5, 80, 790, 345);
  lv_obj_t *ssid_label = create_styled_label(form_card, 0, -5, "WiFi Network (SSID):");
  lv_obj_set_style_text_color(ssid_label, lv_color_hex(0xcccccc), LV_PART_MAIN);
  ui_taSSID = create_modern_textarea(form_card, 0, 20, 300, 35, true, false, ui_event_taSSID, ssid, "Enter WiFi SSID");
  lv_obj_t *pwd_label = create_styled_label(form_card, 360, -5, "WiFi Password:");
  lv_obj_set_style_text_color(pwd_label, lv_color_hex(0xcccccc), LV_PART_MAIN);
  ui_taPassword = create_modern_textarea(form_card, 360, 20, 300, 35, true, true, ui_event_taPassword, password, "Enter password");
  lv_obj_t *metar_label = create_styled_label(form_card, 0, 75, "METAR ID (4 letters):");
  lv_obj_set_style_text_color(metar_label, lv_color_hex(0xcccccc), LV_PART_MAIN);
  ui_taMetarId = create_modern_textarea(form_card, 0, 100, 300, 35, true, false, ui_event_taMetarId, metar_id, "e.g. KJFK");
  lv_obj_t *offset_label = create_styled_label(form_card, 360, 75, "Time Offset (seconds):");
  lv_obj_set_style_text_color(offset_label, lv_color_hex(0xcccccc), LV_PART_MAIN);
  ui_taTimeOffset = create_modern_textarea(form_card, 360, 100, 300, 35, true, false, ui_event_taTimeOffset, String(time_offset).c_str(), "UTC offset");
  // Help card 
  lv_obj_t *help_card = create_card(ui_scrSetting, 5, 430, 790, 45);
  lv_obj_t *help_title = create_styled_label(help_card, 0, -5, "Help:", nullptr, true);
  lv_obj_set_style_text_color(help_title, lv_color_hex(0x3366ff), LV_PART_MAIN);
  lv_obj_t *help_text = create_styled_label(help_card, 50, -5, "METAR ID: Find airport codes at wikipedia.org/wiki/ICAO_airport_code", nullptr);
  lv_obj_set_style_text_color(help_text, lv_color_hex(0x888888), LV_PART_MAIN); 
  // Keyboard - positioned better
  ui_kb = lv_keyboard_create(ui_scrSetting);
  lv_keyboard_set_textarea(ui_kb, ui_taSSID);
  lv_obj_add_flag(ui_kb, LV_OBJ_FLAG_HIDDEN);
  lv_obj_set_style_text_color(ui_kb, lv_color_white(), LV_PART_MAIN);
  lv_obj_set_style_bg_color(ui_kb, lv_color_hex(0x1a1a1a), LV_PART_MAIN);
  lv_obj_add_event_cb(ui_kb, ui_event_kb, LV_EVENT_ALL, NULL);
  // Position keyboard at bottom when visible
  lv_obj_set_size(ui_kb, 770, 150);
  lv_obj_align(ui_kb, LV_ALIGN_BOTTOM_MID, 0, -10);
}

// Initialize UI with modern theme
void ui_init(void) {
  lv_disp_t *display = lv_display_get_default();
  lv_theme_t *theme = lv_theme_default_init(display, lv_palette_main(LV_PALETTE_BLUE), lv_palette_main(LV_PALETTE_RED), true, LV_FONT_DEFAULT);
  lv_disp_set_theme(display, theme);
  
  ui_scrMain_screen_init();
  ui_scrSetting_screen_init();
  lv_disp_load_scr(ui_scrMain);
}

void weatherData() {
  HTTPClient http;
  http.setTimeout(10000);  
  WiFiClientSecure client;
  client.setInsecure();    
  char urlBuffer[100];
  snprintf(urlBuffer, sizeof(urlBuffer), "https://aviationweather.gov/api/data/metar?ids=%s&format=json", metar_id);
  log_i("Fetching METAR from: %s via HTTPS", urlBuffer);
  if (!http.begin(client, urlBuffer)) {
    log_i("Failed to initialize HTTPS connection");
    http.end();
    return;
  }
  http.setReuse(false); 
  log_i("Sending GET request...");
  int httpCode = http.GET();
  log_i("HTTP status code: %d", httpCode);
  if (httpCode != 200) {
    String errorResponse = http.getString();
    log_i("HTTP request failed with code: %d, Response: %s", httpCode, errorResponse.substring(0, 200).c_str());
    http.end();
    return;
  }
  String responseStr = http.getString();
  if (responseStr.length() == 0) {
    log_i("Empty response received");
    http.end();
    return;
  }
  http.end();
  JsonDocument doc;
  DeserializationError error = deserializeJson(doc, responseStr);
  if (error) {
    log_i("JSON parsing failed: %s", error.c_str());
    return;
  }
  if (!doc.is<JsonArray>() || doc.as<JsonArray>().size() == 0) {
    log_i("Invalid METAR JSON structure: not an array or empty");
    return;
  }
  JsonObject obj = doc[0].as<JsonObject>();
  if (obj["icaoId"].isNull() || obj["temp"].isNull()) {
    log_i("Invalid METAR JSON structure: missing icaoId or temp");
    return;
  }
  const char* newId = obj["icaoId"];
  if (strcmp(newId, metar_id) != 0) {
    log_i("METAR ID mismatch: %s vs %s", newId, metar_id);
    return;
  }
  temperature = obj["temp"] | 0;
  dew_point = obj["dewp"] | 0;
  wind_speed_knots = obj["wspd"] | 0;
  pressure = obj["altim"] | 0;
  obsTime = obj["obsTime"] | 0;
  lat = obj["lat"].as<float>();
  lon = obj["lon"].as<float>();
  wind_speed_kmh = wind_speed_knots * 1.852;
  float t = temperature, d = dew_point;
  relative_humidity = 100 * exp((17.625 * d) / (243.04 + d)) / exp((17.625 * t) / (243.04 + t));
  const char* name = obj["name"] | "Unknown";
  strncpy(airport_name, name, sizeof(airport_name) - 1);
  airport_name[sizeof(airport_name) - 1] = '\0';
  metar_url = urlBuffer;
  log_i("METAR updated: T=%d°C, DP=%d°C, WS=%dkn, P=%dhPa, RH=%d%% Lat=%.3f, Lon=%.3f",
        temperature, dew_point, wind_speed_knots, pressure, relative_humidity, lat, lon);
}

#define LEAP_YEAR(Y) ((Y>0)&&!(Y%4)&&((Y%100)||!(Y%400)))
String getFormattedDate(unsigned long e){
 unsigned long d=e/86400L,t=0;int y=1970,m=0;
 static const uint8_t md[]={31,28,31,30,31,30,31,31,30,31,30,31};
 while((t+=LEAP_YEAR(y)?366:365)<=d)y++;
 d-=t-(LEAP_YEAR(y)?366:365);
 for(;m<12&&d>=(m==1&&LEAP_YEAR(y)?29:md[m]);m++)d-=m==1&&LEAP_YEAR(y)?29:md[m];
 char b[20];snprintf(b,sizeof(b),"%02lu-%02d-%04d",d+1,m+1,y);return String(b);
}

String getFormattedTime(unsigned long e){
 unsigned long t=e%86400;char b[9];
 snprintf(b,sizeof(b),"%02u:%02u:%02u",(uint)(t/3600),(uint)((t%3600)/60),(uint)(t%60));
 return String(b);
}

// rise = true = sunrise // rise = false = sunset
String sun_event(unsigned long t, float lat, float lon, bool rise, long time_offset) {
  log_i("Time: %s %s", getFormattedTime(t).c_str(), getFormattedDate(t).c_str());
  log_i("Sun_event input: t=%lu, lat=%.3f, lon=%.3f, rise=%d, time_offset=%ld", t, lat, lon, rise, time_offset);
  double n = t / 86400.0 - 10957.5, L = fmod(280.46 + 0.9856474 * n, 360) * 0.017453293;
  double g = fmod(357.528 + 0.9856003 * n, 360) * 0.017453293, lam = L + 0.033423 * sin(g) + 0.000349 * sin(2*g);
  double decl = asin(0.39782 * sin(lam)), EoT = 4 * (L * 57.295779 - atan2(0.91746 * sin(lam), cos(lam)) * 57.295779);
  if (EoT > 720) EoT -= 1440; 
  if (EoT < -720) EoT += 1440;
  double cosh = (sin(-0.014544) - sin(lat * 0.017453293) * sin(decl)) / (cos(lat * 0.017453293) * cos(decl));
  if (cosh < -1 || cosh > 1) return String(cosh < -1 ? "No sunset" : "No sunrise");
  double h = acos(cosh) * 57.295779, stime = fmod(12 - lon/15 - EoT/60 + (rise ? -h : h)/15 + 24, 24);
  t = (t/86400)*86400 + (unsigned long)(stime * 3600) + time_offset;
  unsigned long d = t/86400 + 719163, y = 1970 + d/365, doy = d % 365;
  if (doy > 58 && ((y%4==0 && y%100!=0) || y%400==0)) doy++;
  int m = doy < 31 ? 1 : doy < 59 ? 2 : doy < 90 ? 3 : doy < 120 ? 4 : doy < 151 ? 5 : 
          doy < 181 ? 6 : doy < 212 ? 7 : doy < 243 ? 8 : doy < 273 ? 9 : doy < 304 ? 10 : doy < 334 ? 11 : 12;
  int day = doy - (m==1?0:m==2?31:m==3?59:m==4?90:m==5?120:m==6?151:m==7?181:m==8?212:m==9?243:m==10?273:m==11?304:334) + 1;
  char buf[32]; 
  snprintf(buf, 32, "%02d:%02d:%02d %02d-%02d-%04d", (int)(t%86400)/3600, (int)(t%3600)/60, (int)t%60, day, m, (int)y);
  return String(buf);
}

// Update time and date display
void update_time_cb(lv_timer_t *timer) {
  if (WiFi.status() != WL_CONNECTED) return; // Exit if not connected to WiFi
  timeClient.update();
  if (timeClient.isTimeSet()) {
    unsigned long epochtime = timeClient.getEpochTime();
    update_label(lblTimeDate, LV_SYMBOL_LIST " %s %s", getFormattedTime(epochtime).c_str(), getFormattedDate(epochtime).c_str());
  }
}

// Get weather icon based on conditions
const char* getWeatherIcon(int temp, int humidity, int wind_speed) {
  if (temp < 0) return LV_SYMBOL_MINUS; // Cold/Snow
  else if (humidity > 80) return LV_SYMBOL_TINT; // Rainy/Humid
  else if (wind_speed > 20) return LV_SYMBOL_GPS; // Windy
  else if (temp > 25) return LV_SYMBOL_WIFI; // Hot/Sunny
  else return LV_SYMBOL_EYE_OPEN; // Normal
}

// Update weather data display with enhanced visuals
void update_weather_cb(lv_timer_t *timer) {
  if (WiFi.status() != WL_CONNECTED) return;
  if (WiFi.localIP() == IPAddress(0, 0, 0, 0))  return;
  weatherData();
  
  // Update weather icon based on conditions
  const char* weather_icon = getWeatherIcon(temperature, relative_humidity, wind_speed_kmh);
  update_label(lblWeatherIcon, "%s", weather_icon);
  
  // Update weather data with icons
  update_label(lblTemperature, LV_SYMBOL_BATTERY_3 " %d°C", temperature);
  update_label(lblHumidity, LV_SYMBOL_TINT " %d%%", relative_humidity);
  update_label(lblWindSpeed, LV_SYMBOL_GPS " %d km/h", wind_speed_kmh);
  update_label(lblPressure, LV_SYMBOL_POWER " %d hPa", pressure);
  update_label(lblAirportName, LV_SYMBOL_HOME " %s", normalizeString(airport_name).c_str());
  
  if (timeClient.isTimeSet() && obsTime > 0) {
    unsigned long epochtime = timeClient.getEpochTime();
    unsigned long data_age_min = (epochtime - time_offset - obsTime) / 60;
    update_label(lblDataAge, LV_SYMBOL_REFRESH " %lu min ago", data_age_min);
    
