OttoMeister/esp32-metar-weather/src/main.cpp
    log_i("Temperature: %d", (int)temperature);
    log_i("Relative humidity: %d%%", (int)relative_humidity);
    log_i("Wind speed: %d km/h", (int)wind_speed_kmh);
    log_i("Pressure: %d hPa", (int)pressure);
    log_i("Data age: %u min", data_age_min);
    log_i("Epochtime: %u sec", epochtime);
    
    // Calculate and display sunrise/sunset
    if (lat != 0 && lon != 0) {
      String sunrise = sun_event(epochtime, lat, lon, true, time_offset);
      String sunset = sun_event(epochtime, lat, lon, false, time_offset);
      
      // Extract just the time portion for display
      int space_pos = sunrise.indexOf(' ');
      String sunrise_time = space_pos > 0 ? sunrise.substring(0, space_pos) : sunrise;
      space_pos = sunset.indexOf(' ');
      String sunset_time = space_pos > 0 ? sunset.substring(0, space_pos) : sunset;
      
      update_label(lblSunrise, LV_SYMBOL_UP " %s", sunrise_time.c_str());
      update_label(lblSunset, LV_SYMBOL_DOWN " %s", sunset_time.c_str());
      
      log_i("Next sunrise: %s", sunrise.c_str());
      log_i("Next sunset: %s", sunset.c_str());
    } else {
      update_label(lblSunrise, LV_SYMBOL_UP " --:--");
      update_label(lblSunset, LV_SYMBOL_DOWN " --:--");
    }
  } else {
    update_label(lblDataAge, LV_SYMBOL_REFRESH " -- min ago");
    update_label(lblSunrise, LV_SYMBOL_UP " --:--");
    update_label(lblSunset, LV_SYMBOL_DOWN " --:--");
  }
}

// Initialize hardware and software
void setup() {
  Serial.begin(115200);
  while (!Serial) delay(10);
  Serial.setDebugOutput(true);
  log_i("Booting...");
  uint32_t chipId1 = 0, chipId2 = 0;
  uint64_t mac = ESP.getEfuseMac();
  chipId1 = (uint32_t)(mac >> 24) & 0xFFFFFF;
  uint8_t macAddr[6];
  WiFi.macAddress(macAddr);
  chipId2 = (macAddr[3] << 16) | (macAddr[4] << 8) | macAddr[5];
  log_i("Chip ID1 (EFuse): %u", chipId1);
  log_i("Chip ID2 (Wi-Fi MAC): %u", chipId2);
  log_i("CPU: %s rev%d, CPU Freq: %d Mhz, %d core(s)", ESP.getChipModel(), ESP.getChipRevision(), getCpuFrequencyMhz(), ESP.getChipCores());
  log_i("Board: %s", BOARD_NAME);
  log_i("Free heap: %d bytes", ESP.getFreeHeap());
  log_i("Free PSRAM: %d bytes", ESP.getPsramSize());
  log_i("SDK version: %s", ESP.getSdkVersion());
  smartdisplay_init();
  smartdisplay_lcd_set_backlight(1.0);
  load_configurations();
  WiFi.mode(WIFI_STA);
  ui_init();
  lv_timer_create(update_time_cb, 1000, NULL);
  lv_timer_create(update_weather_cb, 60000, NULL);
  lv_timer_create(wifi_management_cb, 1000, NULL);
  timeClient.setTimeOffset(time_offset);
  timeClient.begin();
}

auto lv_last_tick = millis();
void loop() {
  auto now = millis();
  lv_tick_inc(now - lv_last_tick);
  lv_last_tick = now;
  lv_timer_handler();
}
